app/controllers/pages_controller.rb

SELECT "pages".* FROM "pages" WHERE "pages"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "tags".* FROM "tags" WHERE "tags"."page_id" = 1
SELECT COUNT(*) FROM "tags" WHERE "tags"."page_id" = 1
SELECT "categories".* FROM "categories" WHERE "categories"."page_id" = 2
SELECT COUNT(*) FROM "categories" WHERE "categories"."page_id" = 1
---
  def show
    @page = Page.find(params[:id])
    @tags = Tag.where(:page_id => params[:id])
    @categories = Category.where(:page_id => params[:id])

INSERT INTO "pages" ("content", "created_at", "date_created", "date_updated", "deleted_at", "heading", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @page = Page.new(params[:page])

    respond_to do |format|
      if @page.save

SELECT "pages".* FROM "pages" WHERE "pages"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "pages" SET "content" = 'this site was built complete from scratch. it was built using "ruby on rails" on the backend and "foundation by zurb" on the front-end. all page, post, category, and tag information are stored in a sqlite database. this site is also posted up on github and can be found <a href="https://github.com/nwestfall/ICSI_Final_Project" target="_blank">here</a>. this site was made for the ualbany icsi 105 course.', "updated_at" = '2013-12-10 22:08:32.944710' WHERE "pages"."id" = 3
---
  def update
    @page = Page.find(params[:id])

    respond_to do |format|
      if @page.update_attributes(params[:page])