app/controllers/posts_controller.rb

  def show
    @post = Post.find(params[:id])
    @tags = Tag.where(:post_id => params[:id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "tags".* FROM "tags" WHERE "tags"."post_id" = 1

  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("content", "created_at", "date_created", "date_updated", "deleted_at", "name", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def update
    @post = Post.find(params[:id])

    respond_to do |format|
      if @post.update_attributes(params[:post])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "posts" SET "name" = 'ruby on rails', "content" = 'ruby on rails is thing most people don''t understand. ruby is a programming language and rails is the framework it runs on. ruby by itself is great programming language. it is rated as one of the fastest and can be used for integration with java, web development, and even create muds. rails is a framework that slows down ruby. it''s active record system does not call upon database efficiently. even with this defect i still like to use it. a good alternative is node.js.', "updated_at" = '2013-12-11 02:10:44.070553' WHERE "posts"."id" = 2